Repository: halid-ali/workHourTracker
Catalog: lib/l10n/intl_*.arb
Languages: de, tr

# appTitle
source: Work Hour Tracker
de: Arbeitszeit Tracker
tr: Çalışma Saat Takibi

# dropdownDefault
source: Select an option
de: Wähle eine Option
tr: Opsiyon seçiniz

# listHeaderOption
source: Option
tr: Opsiyon

# listHeaderStart
source: Start
tr: Başlangıç

# listHeaderBreak
source: Break
de: Pause
tr: Mola

# listHeaderWork
source: Work
de: Arbeit
tr: Çalışma

# footerTotal
source: Total
de: Gesamt
tr: Toplam

source: Login
de: Anmelden
tr: Giriş

source: Logout
de: Abmelden
tr: Çıkış

source: Register
tr: Kayıt

source: Settings
de: Einstellungen
tr: Ayarlar

source: Username
de: Benutzername
tr: Kullanıcı adı

source: Password
de: Passwort
tr: Şifre

source: Repeat Password
de: Passwort wiederholen
tr: Şifre Tekrar

# required_field
source: Required
de: Erforderlich
tr: Zorunlu

# username_empty
source: Username cannot be null.
de: Benutzername darf nicht null sein.
tr: Kullanıcı adı boş olamaz.

# username_invalid_length
source: Length must be between 5-15.
de: Die Länge muss zwischen 5-15 liegen.
tr: Uzunluk 5-15 arasında olmalı.

# password_empty
source: Password cannot be null.
de: Das Passwort darf nicht null sein.
tr: Şifre boş olamaz.

# password_invalid_length
source: Password length must be between 7-20.
de: Die Passwortlänge muss zwischen 7 und 20 liegen.
tr: Şifre uzunluğu 7-20 arasında olmalı.

# password_buffer_prefix
source: Password must contain at least
de: Das Passwort muss mindestens
tr: Şifre en az bir adet

# password_contains_uppercase
source: one uppercase letter.
de: einen Großbuchstaben enthalten.
tr: büyük harf içermeli.

# password_contains_lowercase
source: one lowercase letter.
de: einen Kleinbuchstaben enthalten.
tr: küçük harf içermeli.

# password_contains_digit
source: one digit.
de: eine Ziffer enthalten.
tr: rakam içermeli.

# password_contains_special_character
source: one special character.
de: ein Sonderzeichen enthalten.
tr: özel karakter içermeli.

# password_not_match
source: Password doesn't match.
de: Passwort stimmt nicht überein.
tr: Şifre eşleşmedi.

# email_empty
source: Email cannot be null.
de: E-Mail kann nicht null sein.
tr: Email boş olamaz.

# email_invalid
source: Invalid email address.
de: Ungültige E-Mail-Adresse.
tr: Geçersiz email adresi.

source: Select user
de: Wähle den Benutzer
tr: Kullanıcı seçiniz

source: or
de: oder
tr: ya da

source: Forgot password?
de: Passwort vergessen?
tr: Şifrenizi mi unuttunuz?

source: Wrong password!
de: Falsches Passwort!
tr: Yanlış şifre!

# select_user_toast
source: Please select a user.
de: Bitte wählen Sie einen Benutzer.
tr: Lütfen bir kullanıcı seçiniz.

# timer_started
source: The timer is started.
de: Der Timer wird gestartet.
tr: Sayaç başlatıldı.

# timer_stopped
source: The timer is stopped.
de: Der Timer wird gestoppt.
tr: Sayaç sonlandırıldı.

# timer_paused
source: The timer is paused.
de: Der Timer ist angehalten.
tr: Sayaç duraklatıldı.

# timer_resumed
source: The timer is resumed.
de: Der Timer wird fortgesetzt.
tr: Sayaç sürdürülüyor.

source: Error occurred.
de: Ein Fehler ist aufgetreten.
tr: Hata oluştu.

source: Work Hour Options
de: Arbeitszeitoptionen
tr: Çalışma Saati Seçenekleri

source: Details
de: Einzelheiten
tr: Detaylar

source: Edit
de: Bearbeiten
tr: Düzenle

source: Delete
de: Löschen
tr: Sil

# option_deleted
source: {optionName} is deleted.
de: {optionName} wird gelöscht.
tr: {optionName} silindi.

source: Yes
de: Ja
tr: Evet

source: No
de: Nein
tr: Hayır

# option_will_deleted
source: "{optionName}" will be deleted.
de: "{optionName}" wird gelöscht werden.
tr: "{optionName}" silinecek.

# really_delete
source: Do you really want to delete it?
de: Möchten Sie es wirklich löschen?
tr: Gerçekten silmek istiyor musunuz?

source: Warning
de: Achtung
tr: Dikkat

source: Available Options
de: Verfügbare Optionen
tr: Aktif Seçenekler

source: Add Option
de: Option Hinzufügen
tr: Seçenek Ekle

source: Edit Option
de: Option Aktualisieren
tr: Seçenek Düzenle

source: Add new option
de: Neue Option hinzufügen
tr: Yeni seçenek ekle

source: Add
de: Hinzufügen
tr: Ekle

source: Cancel
de: Abbrechnen
tr: Iptal

# option_name
source: Name
tr: Ad

# option_description
source: Description
de: Beschreibung
tr: Tanım

# new_option_added
source: New option "{optionName}" is added.
de: Neue Option "{optionName}" wurde hinzugefügt.
tr: Yeni seçenek "{optionName}" eklendi.

# add_error_message
source: Failed to add work hour option.
de: Neue Option konnte nicht hinzugefügt werden.
tr: Yeni seçenek ekleme başarısız.

# update_error_message
source: Failed to update work hour option.
de: Die Option konnte nicht aktualisiert werden.
tr: Seçenek güncelleme başarısız.

# delete_error_message
source: Failed to delete work hour option.
de: Die Option konnte nicht gelöscht werden.
tr: Seçenek silme başarısız.

# console_details
source: Please see the console for details.
de: Weitere Informationen finden Sie in der Konsole.
tr: Detaylar için konsola bakınız.

# route_exception_message
source: Route not found.
de: Route nicht gefunden
tr: Sayfa bulunamadı

# status_exception_message
source: Invalid timer status.
de: Ungültiger Timer-status
tr: Geçersiz zamanlayıcı durumu

# successful_register_message
source: Registered successfully.
de: Registrierung ist erfolgreich.
tr: Kayıt başarılı.

# unsuccessful_register_message
source: Error occurred during register. See console for details.
de: Registrierung fehlgeschlagen. Einzelheiten finden Sie in der Konsole.
tr: Kayıt esnasında hata oluştu. Detaylar için konsola bakınız.

# user_data_load
source: User data is being loaded.
de: Benutzerdaten wird geladen.
tr: Kullanıcı bilgisi yükleniyor.

# user_data_load_error
source: Error occurred while loading user data.
de: Beim Laden der Benutzerdaten ist ein Fehler aufgetreten.
tr: Kullanıcı bilgisi yüklenirken hata oluştu.

# workhour_data_load
source: Work hours are being loaded.
de: Arbeitszeiten werden geladen.
tr: Çalışma saatleri yükleniyor.

# workhour_data_load_error
source: Error occurred while loading work hours.
de: Beim Laden der Arbeitszeiten ist ein Fehler aufgetreten.
tr: Çalışma saatleri yüklenirken hata oluştu.

# option_data_load
source: Options are being loaded.
de: Optionen werden geladen.
tr: Opsiyonlar yükleniyor.

# option_data_load_error
source: Error occurred while loading options.
de: Beim Laden der Optionen ist ein Fehler aufgetreten.
tr: Opsiyonlar yüklenirken hata oluştu.

# last_option_data_load
source: Last running option is being loaded.
de: Die zuletzt ausgeführte Option wird geladen.
tr: Son çalışan opsiyon bilgisi yükleniyor.

# last_option_data_load_error
source: Error occurred while loading last running option.
de: Beim Laden der zuletzt ausgeführt Option ist ein Fehler aufgetreten.
tr: Son çalışan opsiyon bilgisi yüklenirken hata oluştu.

# hour_unit
source: h
tr: s

# minute_unit
source: m
tr: d

# second_unit
source: s
tr: sn

# application_settings
source: Application
de: Anwendung
tr: Uygulama

# display_settings
source: Display
de: Darstellung
tr: Ekran

source: Language
de: Sprache
tr: Dil

# settings_data_load
source: Settings are being loaded.
tr: Ayarlar yükleniyor.

# settings_data_load_error
source: Error occurred while loading settings.
tr: Ayarlar yüklenirken hata oluştu.

# session_data_load
source: Session data is being loaded.
tr: Oturum bilgileri yükleniyor.

# session_data_load_error
source: Error occurred while loading session data.
tr: Oturum bilgileri yüklenirken hata oluştu.

# user_not_found
source: Username cannot be found.
tr: Kullanıcı adı bulunamadı.

source: History
tr: Geçmiş

# history_load
source: History is being loaded.
tr: Geçmiş yükleniyor.

# history_load_error
source: Error occurred while loading history.
tr: Geçmiş yüklenirken hata oluştu.
